Emacs.org
#+title: Emacs Configuration

* Inspirations of this Emacs configuration

The organization of this emacs configuration was inspired by [[https://protesilaos.com/emacs/dotemacs][prot's dotemacs configuration]].

This literate configuration has a script that will convert this file into an =astro.js= page for ease of reference.

* Getting Started

This org file is used to set up my emacs configuration. The code blocks of this org file
will be executed using =org-babel-tangle=. Thus, to initiate you must use =M-x ^org-babel-tangle= or use the key-binding =C-c C-v t=.

** Dependencies

*** aporetic typeface

The GUI version of Emacs uses this typeface, so make sure to have aporetic installed. Here is the [[https://github.com/protesilaos/aporetic][repo]] for the install instructions.

For macos users, you can simply run

#+begin_src bash

  brew install font-aporetic

#+end_src


** Running Emacs

To run emacs in the command-line/terminal simply use the following command while in your command-line/terminal: =emacs -nw=.

* The early initialization of Emacs (=early-init.el=) 

** The =early-init.el= macro to run code only in a Desktop Environment

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  (defvar jw-emacs-tiling-window-manager-regexp "bspwm\\|herbstluftwm\\|i3"
    "Regular expression to  tiling window managers.
  See definition of `prot-emacs-with-desktop-session'.")

  (defmacro jw-emacs-with-desktop-session (&rest body)
    "Expand BODY if desktop session is not a tiling window manager.
  See `prot-emacs-tiling-window-manager-regexp' for what
  constitutes a matching tiling window manager."
    (declare (indent 0))
    `(when-let ((session (getenv "DESKTOP_SESSION"))
                ((not (string-match-p session jw-emacs-tiling-window-manager-regexp))))
       ,@body))

#+end_src

** The =early-init.el= code to set frame parameters

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  ;; Set frame parameters early (without font-related settings;; )
  (setq initial-frame-alist
        (append '((alpha . (90 . 90))
                  (fullscreen . maximized))
                initial-frame-alist))

  (setq default-frame-alist
        (append '((alpha . (90 . 90))
                  (fullscreen . maximized))
                default-frame-alist))


#+end_src

** The =early-init.el= basic frame settings

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-dialog-box t ; only for mouse events, which I seldom use
        use-file-dialog nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-x-resources t
        inhibit-startup-echo-area-message user-login-name ; read the docstring
        inhibit-startup-buffer-menu t)

  ;; I do not use those graphical elements by default, but I do enable
  ;; them from time-to-time for testing purposes or to demonstrate
  ;; something.  NEVER tell a beginner to disable any of these.  They
  ;; are helpful.
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)

#+end_src
** The =early-init.el= hook to improve Startup Performance

Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.

Also, turn on =lexical-binding= for the init file!

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  ;; -*- lexical-binding: t; -*-

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))

#+end_src

** The =early-init.el= defines general theme related functions

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes
  (defun jw-emacs-theme-gsettings-dark-p ()
    "Return non-nil if gsettings (GNOME) has a dark theme.
  Return nil if the DESKTOP_SESSION is either bspwm or
  herbstluftwm, per the configuration of my dotfiles.  Also check
  the `delight' shell script."
    (jw-emacs-with-desktop-session
      (string-match-p
       "dark"
       (shell-command-to-string "gsettings get org.gnome.desktop.interface color-scheme"))))

  (defun jw-emacs-theme-twm-dark-p ()
    "Return non-nil if my custom setup has a dark theme.
  I place a file in ~/.config/prot-xtwm-active-theme which contains
  a single word describing my system-wide theme.  This is part of
  my dotfiles.  Check my `delight' shell script for more."
    (when-let ((file "~/.config/jw-xtwm-active-theme")
               ((file-exists-p file)))
        (string-match-p
         "dark"
         (with-temp-buffer
           (insert-file-contents file)
           (buffer-string)))))

  (defun jw-emacs-theme-environment-dark-p ()
    "Return non-nil if environment theme is dark."
    (or (jw-emacs-theme-twm-dark-p)
        (jw-emacs-theme-gsettings-dark-p)))

  (defun jw-emacs-re-enable-frame-theme (_frame)
    "Re-enable active theme, if any, upon FRAME creation.
  Add this to `after-make-frame-functions' so that new frames do
  not retain the generic background set by the function
  `prot-emacs-avoid-initial-flash-of-light'."
    (when-let ((theme (car custom-enabled-themes)))
      (enable-theme theme)))

#+end_src

** The =early-init.el= gives a name to the default frame

The following configuration is taken from [[https://protesilaos.com/emacs/dotemacs#h:ad227f7e-b0a7-43f8-91d6-b50db82da9ad][prot's configuration]], with the description from Prot,

"Finally, I like to call my default frame =home=. This is because I use my =beframe= package to group the list of buffers on a per-frame basis ([[https://protesilaos.com/emacs/dotemacs#h:77e4f174-0c86-460d-8a54-47545f922ae9][The prot-emacs-window.el section about beframe]]). The multi-frame arrangement is the best thing I ever did to boost my productivity: bonus points when used in tandem with a tiling window manager.

Naming frames allows you to select them using completion. Emacs can do this (=M-x select-frame-by-name=), though it is not always reliable as it depends on the window manager (it works fine on GNOME, from what I can tell). For minimalist window managers on Linux, something like the =rofi= program can select system windows based on their name."

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  (add-hook 'after-init-hook (lambda () (set-frame-name "home")))

#+end_src

** The =early-init.el= section to add modules and libraries to the Emacs configuration

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  (add-to-list 'load-path (expand-file-name "jw-emacs-modules" user-emacs-directory))
  (add-to-list 'load-path (expand-file-name "jw-lisp" user-emacs-directory))

#+end_src

* The main initialization of Emacs (=init.el=)

** The =init.el= key installations post-=early-init.el=

These installations do not require the package manager to be configured and are also essential for the functioning of the rest of this configuration.

*** straight.el

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

    ;; installation of straight.el package manager
    (defvar bootstrap-version)
    (let ((bootstrap-file
            (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
            (bootstrap-version 5))
        (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
            "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
            'silent 'inhibit-cookies)
            (goto-char (point-max))
            (eval-print-last-sexp)))
        (load bootstrap-file nil 'nomessage))

#+end_src

** The =init.el= for aesthetics 

Want to disable to mode-line at the very start and enable it when the mode-line configuration is loaded to make startup look smooth. The mode-line will be added when the mode-line is loaded ([[*The =jw-emacs-modeline.el= to enable the mode-line][The =jw-emacs-modeline.el= to enable the mode-line]]).

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

    ;; conditional to remove display of mode-line
    (setq-default mode-line-format nil)

#+end_src


#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

    (require 'dired)

    ;; make dired look nice
    (add-hook 'dired-mode-hook
                (lambda ()
                (define-key dired-mode-map (kbd "(") 'dired-hide-details-mode)
                ;; Uncomment the next line to start with details hidden
                (dired-hide-details-mode 1)
                ))

#+end_src


** The =init.el= for package manager

[[https://github.com/jwiegley/use-package][use-package]] is a native package built into emacs since =v29.0.0= and is used in this configuration to make it a lot easier to automate the installation and configuration of everything else.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

    ;; Install use-package
    (straight-use-package 'use-package)

    (setq straight-use-package-by-default t)

#+end_src

To debug =use-package= run =emacs --debug-init=.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (if init-file-debug
      (setq use-package-verbose t
            use-package-expand-minimally nil
            use-package-compute-statistics t
            debug-on-error t)
    (setq use-package-verbose nil
          use-package-expand-minimally t))

#+end_src


** The =init.el= for keeping =.emacs.d= clean

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))

  ;; auto-save-mode doesn't create the path automatically!
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)

  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

  (use-package no-littering
    :straight t)

#+end_src

** The =init.el= for easy leader key management (=general.el=)

[[https://github.com/noctuid/general.el][general.el]] is a fantastic library for defining prefixed keybindings, especially
in conjunction with Evil modes.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (use-package general
    :straight t
    :config
    (general-create-definer jw/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"))

#+end_src

** The =init.el= essential key configurations

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; bind quit prompting func to escape
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src


#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; use spaces instead of tabs for indentation
  (setq-default indent-tabs-mode nil)

#+end_src


#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes
  ;; for ui toggles
  (jw/leader-key-def
    "t"  '(:ignore t :which-key "toggles")
    "tw" 'whitespace-mode
    )

#+end_src

*** evil-mode

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes
  (use-package evil
    :straight t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (evil-set-undo-system 'undo-redo)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
    (define-key evil-normal-state-map (kbd "C-r") 'evil-redo)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :straight t
    :config
    (evil-collection-init)
    (with-eval-after-load 'forge
    (evil-collection-forge-setup)))


#+end_src

***  smooth scrolling

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; Enable smooth scrolling with a margin
  (setq scroll-margin 5)          ; Start scrolling when cursor is 5 lines from top/bottom
  (setq scroll-conservatively 100) ; Scroll line by line, not by half-screen jumps
  (setq scroll-step 1)            ; Scroll one line at a time when needed


#+end_src

** The =init.el= setting to always start with the *scratch* buffer

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; Always start with *scratch*
  (setq initial-buffer-choice t)

#+end_src
** The =init.el= for additional configurations for =emacs=

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; A few more useful configurations...
  (use-package emacs
    :straight t
    :init
    ;; TAB cycle if there are only few candidates
    ;; (setq completion-cycle-threshold 3)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    ;; (setq tab-always-indent 'complete)

    ;; Emacs 30 and newer: Disable Ispell completion function. As an alternative,
    ;; try `cape-dict'.
    (setq text-mode-ispell-word-completion nil)

    ;; Emacs 28 and newer: Hide commands in M-x which do not apply to the current
    ;; mode.  Corfu commands are hidden, since they are not used via M-x. This
    ;; setting is useful beyond Corfu.
    (setq read-extended-command-predicate #'command-completion-default-include-p))

#+end_src

** The =init.el= user options

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; taken from prot's config
  ;; For those who use my dotfiles and need an easy way to write their
  ;; own extras on top of what I already load: search below for the files
  ;; prot-emacs-pre-custom.el and prot-emacs-post-custom.el
  (defgroup jw-emacs nil
    "User options for my dotemacs.
  These produce the expected results only when set in a file called
  prot-emacs-pre-custom.el.  This file must be in the same
  directory as the init.el."
    :group 'file)

#+end_src
