.emacs.d/jw-emacs-modules/jw-emacs-git.el
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/") t)

(setq forge-add-default-bindings nil)

(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; NOTE: Make sure to configure a GitHub token before using this package!
;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
(use-package forge
  :after magit
  )
(use-package evil-collection
  :after (evil forge)
  :config
  (evil-collection-init)
  (evil-collection-forge-setup))

(provide 'jw-emacs-git)
