.emacs.d/jw-emacs-modules/jw-emacs-productivity.el
(use-package pdf-tools
  :straight t
  :config
  (pdf-tools-install)
  :hook (pdf-view-mode . (lambda () 
                       (display-line-numbers-mode -1)
                       (message "PDF Tools activated for this buffer"))))
