Emacs.org
*** org-noter.el and org-pdftools.el

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-productivity.el" :mkdirp yes


  ;; Ensure org-noter is installed
  (use-package org-noter
    :straight t
    :after (org pdf-tools)
    :config
    (setq org-noter-always-create-frame nil))

  ;; Ensure org-pdftools is set up to work with org-mode
  (use-package org-pdftools
    :straight t
    :hook (org-mode . org-pdftools-setup-link))

  ;; Configure org-noter-pdftools
  (use-package org-noter-pdftools
    :after (org-noter pdf-tools)
    :config
    ;; Add a function to ensure precise note is inserted
    (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
      (interactive "P")
      (org-noter--with-valid-session
       (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                     (not org-noter-insert-note-no-questions)
                                                   org-noter-insert-note-no-questions))
             (org-pdftools-use-isearch-link t)
             (org-pdftools-use-freepointer-annot t))
         (org-noter-insert-note (org-noter--get-precise-info)))))

    ;; Fix for the specific issue
    (defun org-noter-set-start-location (&optional arg)
      "When opening a session with this document, go to the current location.
    With a prefix ARG, remove start location."
      (interactive "P")
      (org-noter--with-valid-session
       (let ((inhibit-read-only t)
             (ast (org-noter--parse-root))
             (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
         (with-current-buffer (org-noter--session-notes-buffer session)
           (org-with-wide-buffer
            (goto-char (org-element-property :begin ast))
            (if arg
                (org-entry-delete nil org-noter-property-note-location)
              (org-entry-put nil org-noter-property-note-location
                             (org-noter--pretty-print-location location))))))))

    ;; Add a hook for pdf-annot
    (with-eval-after-load 'pdf-annot
      (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note))

    ;; If you are working with EPUB files
    (use-package nov
      :straight t)

    ;; If you are working with DJVU files
    (use-package djvu
      :straight t))

#+end_src


*** The =jw-emacs-productivity.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-productivity.el" :mkdirp yes

  (provide 'jw-emacs-productivity)

#+end_src


** The =jw-emacs-development.el= module
*** tramp.el --native

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (use-package tramp
    :straight t)
  (setq tramp-default-method "ssh")
  ;; for debugging
  (setq tramp-verbose 3)
  ;; some basic performance enhancements
  (setq remote-file-name-inhibit-locks t
      tramp-use-scp-direct-remote-copying t
      remote-file-name-inhibit-auto-save-visited t)
  ;; disable backup files for tramp
  (add-to-list 'backup-directory-alist
              (cons tramp-file-name-regexp nil))

  (setq tramp-connection-timeout 10) ;; 10 sec timeout
#+end_src


**** direct async

Guide by [[https://coredumped.dev/2025/06/18/making-tramp-go-brrrr./][this blog post]]. 

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (connection-local-set-profile-variables
  'remote-direct-async-process
  '((tramp-direct-async-process . t)))

  (connection-local-set-profiles
  '(:application tramp :protocol "scp")
  'remote-direct-async-process)

  (setq magit-tramp-pipe-stty-settings 'pty)


#+end_src

**** fixing remote compile

=compile= command disables remote ssh connection sharing, which will require you to reenter your password each time you connect. Want to enable this for convienence.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (with-eval-after-load 'tramp
  (with-eval-after-load 'compile
      (remove-hook 'compilation-mode-hook #'tramp-compile-disable-ssh-controlmaster-options)))

#+end_src

**** caching

Cache passwords until the end of the emacs session, which is default.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (setq password-cache-expiry nil)

#+end_src

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

    ;; Configure TRAMP to use ~/.emacs.d/tmp/ for caching
    (let ((tramp-tmp-dir (expand-file-name "tmp/" user-emacs-directory)))
    ;; Ensure the directory exists
    (unless (file-directory-p tramp-tmp-dir)
        (make-directory tramp-tmp-dir t))

    ;; Set TRAMP cache directory
    (setq tramp-persistency-file-name (expand-file-name "tramp-cache" tramp-tmp-dir))

    ;; Set auto-save directory for remote files
    (setq tramp-auto-save-directory tramp-tmp-dir)

    ;; Optional: Set backup directory for remote files to tmp as well
    (setq tramp-backup-directory-alist `(("." . ,tramp-tmp-dir))))

    ;; Enable persistent caching
    (setq tramp-cache-read-persistent-data t)
    (setq tramp-cache-compress t)
    (setq remote-file-name-inhibit-cache nil)

    (defun memoize-remote (key cache orig-fn &rest args)
    "Memoize a value if the key is a remote path."
    (if (and key
            (file-remote-p key))
        (if-let ((current (assoc key (symbol-value cache))))
            (cdr current)
            (let ((current (apply orig-fn args)))
            (set cache (cons (cons key current) (symbol-value cache)))
            current))
        (apply orig-fn args)))

#+end_src


#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

    ;; Memoize current project
    (defvar project-current-cache nil)
    (defun memoize-project-current (orig &optional prompt directory)
    (memoize-remote (or directory
                        project-current-directory-override
                        default-directory)
                    'project-current-cache orig prompt directory))
    (advice-add 'project-current :around #'memoize-project-current)

    ;; Memoize magit top level
    (defvar magit-toplevel-cache nil)
    (defun memoize-magit-toplevel (orig &optional directory)
    (memoize-remote (or directory default-directory)
                    'magit-toplevel-cache orig directory))
    (advice-add 'magit-toplevel :around #'memoize-magit-toplevel)

    ;; memoize vc-git-root
    (defvar vc-git-root-cache nil)
    (defun memoize-vc-git-root (orig file)
    (let ((value (memoize-remote (file-name-directory file) 'vc-git-root-cache orig file)))
        ;; sometimes vc-git-root returns nil even when there is a root there
        (when (null (cdr (car vc-git-root-cache)))
        (setq vc-git-root-cache (cdr vc-git-root-cache)))
        value))
    (advice-add 'vc-git-root :around #'memoize-vc-git-root)

    ;; memoize all git candidates in the current project
    (defvar $counsel-git-cands-cache nil)
    (defun $memoize-counsel-git-cands (orig dir)
    ($memoize-remote (magit-toplevel dir) '$counsel-git-cands-cache orig dir))
    (advice-add 'counsel-git-cands :around #'$memoize-counsel-git-cands)

    ;; Optional: Function to clear cache when needed
    (defun jw/clear-tramp-cache ()
    "Clear TRAMP cache files in ~/.emacs.d/tmp/"
    (interactive)
    (let ((cache-file tramp-persistency-file-name))
        (when (file-exists-p cache-file)
        (delete-file cache-file)
        (message "TRAMP cache cleared"))))

#+end_src

*** project.el  --native

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (require 'project)

#+end_src


Set the project paths, but currently the code below only works for =emacs 30+=.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes
   (defun jw/project-prompter ()
        (read-file-name "Select a project folder:"
                        "~/Otzar/Projects/Code/"
                        nil
                        nil
                        nil
                        #'file-directory-p))
   (setq project-prompter #'jw/project-prompter)

#+end_src

*** visualizing delimiters

=show-paren-mode= allows one to see matching pairs of parentheses and other characters. When point is on the opening character of one of the paired characters, the other is highlighted. When the point is after the closing character of one of the paired characters, the other is highlighted. 

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (show-paren-mode 1)

#+end_src

To visualize all delimiters,

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

