Emacs.org
*** electric-pair-mode.el --native

=electric-pair-mode= will auto pair delimiters for you. One issue with the auto pairing is the =<= character in =org-mode=. The following hook to the enabling of =electric-pair-mode= aims to solve the issue when in =org-mode=.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (electric-pair-mode t)

  (add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

#+end_src

*** evil-surround.el

=evil-surround= emulates [[https://github.com/tpope/vim-surround][surround.vim]]. For usage instructions visit [[https://github.com/emacs-evil/evil-surround][evil-surround]]

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (use-package evil-surround
    :straight t
    :config
    (global-evil-surround-mode 1))

#+end_src

*** command-log-mode.el

For logging keys,

[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame. Great for live streams and screencasts!


#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (use-package command-log-mode)

#+end_src

To activate =command-log-mode= you must first run =M-x global-command-log-mode= to have =command-log-mode= in every buffer and then run =M-x clm/toggle-command-log-buffer= to have the buffer be displayed.

*** The =jw-emacs-development.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (provide 'jw-emacs-development)

#+end_src

** The =jw-emacs-which-key.el= module

There is a user option in my setup to load this module ([[https://protesilaos.com/emacs/dotemacs#h:24324854-1f8c-4d8b-aa7c-291de968cbf4][The init.el option to enable which-key]]).

When the =which-key-mode= is enabled, any incomplete key sequence will produce a popup at the lower part of the Emacs frame showing keys that complete the current sequence together with the name of the command they are invoking.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-which-key.el" :mkdirp yes

  (use-package which-key
    :straight t
    :hook (after-init . which-key-mode)
    :config
    (setq which-key-separator "  ")
    (setq which-key-prefix-prefix "... ")
    (setq which-key-max-display-columns 3)
    (setq which-key-idle-delay 1.5)
    (setq which-key-idle-secondary-delay 0.25)
    (setq which-key-add-column-padding 1)
    (setq which-key-max-description-length 40))

  (provide 'jw-emacs-which-key)

#+end_src

** The =jw-emacs-ai.el= module

The purpose of this module is to have my integrations with llms or other ai models.


*** gptel.el

Incorporates the use of llms in the emacs client. For a great summary of the features please see [[https://www.blogbyben.com/2024/08/gptel-mindblowing-integration-between.html][Ben Simon's video]]. For accessing the source code please see [[https://github.com/karthink/gptel][karthink's repo]].

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-ai.el" :mkdirp yes

  (use-package gptel
    :straight t
    :after auth-source
    :init
    ;; Ensure auth-source is configured to find ~/.authinfo or ~/.authinfo.gpg
    (setq auth-sources '("~/.authinfo.gpg" "~/.authinfo" "~/.netrc"))
    :config
    ;; Helper function to read file contents
    (defun gptel-read-file (file-path)
        "Read the contents of FILE-PATH into a string, trimming whitespace."
        (if (and (file-exists-p file-path) (file-readable-p file-path))
            (with-temp-buffer
            (insert-file-contents file-path)
            (string-trim (buffer-string)))
        (progn
            (message "Warning: File %s is not readable or does not exist" file-path)
            "You are a polymath who is a helpful assistant. Respond concisely and accurately.")))

    ;; Define directives with file paths
    (setq gptel-directives
            (list
            (cons 'default "You are a polymath who is a helpful assistant. Respond concisely and accurately.")
            (cons 'coding (gptel-read-file "~/.dotfiles/.assets/gpt-prompts/coding.txt"))
            (cons 'writing (gptel-read-file "~/.dotfiles/.assets/gpt-prompts/writing.txt"))
            (cons 'research (gptel-read-file "~/.dotfiles/.assets/gpt-prompts/research.txt"))))

    ;; Set default directive
    (setq gptel-default-directive 'coding)

    
    ;; Refresh directives dynamically
    (defun gptel-refresh-directives ()
        "Refresh gptel-directives by re-reading files."
        (interactive)
        (setq gptel-directives
            (list
            (cons 'default "You are a polymath who is a helpful assistant. Respond concisely and accurately.")
            (cons 'coding (gptel-read-file "~/.dotfiles/.assets/gpt-prompts/coding.txt"))
            (cons 'writing (gptel-read-file "~/.dotfiles/.assets/gpt-prompts/writing.txt"))
            (cons 'research (gptel-read-file "~/.dotfiles/.assets/gpt-prompts/research.txt"))))
        (message "Refreshed gptel-directives from files."))

    ;; Set OpenAI API key using gptel-api-key-from-auth-source
    (setq gptel-api-key (lambda ()
                          (auth-source-forget-all-cached)
                          (gptel-api-key-from-auth-source)))
    ;; Configure Google (Gemini) backend
    (gptel-make-gemini "Gemini" :stream t
                        :key (lambda ()
             (auth-source-forget-all-cached)
             (gptel-api-key-from-auth-source "generativelanguage.googleapis.com")))
    ;; Configure Anthropic (Claude) backend
    (gptel-make-anthropic "Claude"
      :stream t
      :key (lambda ()
             (auth-source-forget-all-cached)
             (gptel-api-key-from-auth-source "console.anthropic.com")))
    ;; Optional: Enable debugging for auth-source issues
    ;; (setq auth-source-debug t)
  )

(setq gptel-display-buffer-action
      '(display-buffer-in-side-window
        (side . right)
        (window-width . 0.4)))

#+end_src

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-ai.el" :mkdirp yes

    (defun gptel-save-response ()
    "Save the entire gptel buffer to a file with a user-provided name."
    (interactive)
    (unless (bound-and-true-p gptel-mode)
        (user-error "This command must be run in a gptel-mode buffer"))
    (let* ((response (buffer-string))
            (user-input (read-string "Enter a concise (2-5 words) filename description: ")))
        (if (string-empty-p response)
            (message "Error: Buffer is empty, cannot save file")
        (let* ((clean-name (if (and user-input (stringp user-input) (not (string-empty-p user-input)))
                                (string-trim (replace-regexp-in-string "[^a-zA-Z0-9-]" "" (replace-regexp-in-string "\\s+" "-" user-input)))
                            "fallback-name"))
                (timestamp (format-time-string "%Y%m%dT%H%M%S"))
                (base-dir "~/Otzar/llm-outputs/")
                (filename (concat (file-name-as-directory (expand-file-name base-dir)) timestamp "--" clean-name ".md")))
            (condition-case err
                (progn
                (make-directory base-dir t)
                (write-region (point-min) (point-max) filename nil 'silent)
                (message "Saved buffer to %s" filename))
            (error
            (message "Error saving file: %s" err)))))))


#+end_src


*** The =jw-emacs-ai.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-ai.el" :mkdirp yes

  (provide 'jw-emacs-ai)

#+end_src

** The =jw-emacs-langs.el= module

*** treesitter

Set language sources for treesit

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (setq treesit-language-source-alist
        '((typescript .        ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src"))
          (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src"))
          (python . ("https://github.com/tree-sitter/tree-sitter-python"))
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (cmake "https://github.com/uyha/tree-sitter-cmake")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (r "https://github.com/r-lib/tree-sitter-r")
          (bash "https://github.com/tree-sitter/tree-sitter-bash")
          ))

  (dolist (source treesit-language-source-alist)
    (unless (treesit-ready-p (car source))
      (treesit-install-language-grammar (car source))))

  (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.cpp\\'" . c++-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.c\\'" . c-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.mdx\\'" . markdown-mode))
  (add-to-list 'major-mode-remap-alist '(
                                         (python-mode . python-ts-mode)
                                         (json-mode . json-ts-mode)
                                         (css-mode . css-ts-mode)
                                         (bash-mode . bash-ts-mode)
                                         (yaml-mode . yaml-ts-mode)
                                         (c++-mode . c++-ts-mode)
                                         (c-mode . c-ts-mode)
                                         ))
#+end_src


The issue with the built in =treesit.el= is that it does not auto default to which language server. In addition if you need to install you will have to input the url yourself. This package is here to automate the process.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (use-package treesit-auto
    :straight t
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))

#+end_src

Auto install grammars when missing

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (setq treesit-auto-install 'prompt)

#+end_src


*** latex

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

(use-package auctex
  :straight t
  :defer t
  :init
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq TeX-PDF-mode t) ; Enable PDF output by default
  :config
  ;; Set the default engine
  (setq TeX-engine 'default)
  
  ;; Put auxiliary files in a tmp subdirectory
  (setq TeX-output-dir "tmp/")
  (setq LaTeX-output-directory "tmp/")
  
  ;; Simplified PDF viewer configuration for macOS
  (when (eq system-type 'darwin) ; macOS only
    (setq TeX-view-program-list '(("Preview" "open -a Preview %o")))
    (setq TeX-view-program-selection '((output-pdf "Preview"))))
  
  ;; For non-macOS systems, use default viewer
  (unless (eq system-type 'darwin)
    (setq TeX-view-program-selection '((output-pdf "PDF Tools"))))
  
  ;; Ensure we have a default command
  (setq TeX-command-default "LaTeX")
  
  ;; Auto-revert PDF files when they change
  (add-hook 'TeX-after-compilation-finished-functions
            #'TeX-revert-document-buffer)
  
  ;; LaTeX mode hooks
  (add-hook 'LaTeX-mode-hook 'visual-line-mode) ; Enable word wrap
  (add-hook 'LaTeX-mode-hook 'flyspell-mode)    ; Enable spell checking
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)  ; Enable math mode
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)   ; Enable RefTeX
  
  ;; Ensure TeX-command-run-all works properly
  (add-hook 'LaTeX-mode-hook 
            (lambda ()
              ;; Make sure the master file is set
              (when (and (buffer-file-name)
                         (not TeX-master))
                (setq-local TeX-master (file-name-sans-extension
                                       (file-name-nondirectory (buffer-file-name)))))))
  
  ;; RefTeX configuration
  (setq reftex-plug-into-AUCTeX t))


#+end_src

*** python

Configuring pythone envs with =conda=.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

(use-package conda
  :straight t
  :config
  (setq conda-anaconda-home (expand-file-name "/opt/homebrew/Caskroom/miniconda/base/"))
  (setq conda-env-home-directory (expand-file-name "/opt/homebrew/Caskroom/miniconda/base/envs/"))
  (conda-env-autoactivate-mode t))


#+end_src


Python formatter configuration.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (use-package python-black
    :demand t
    :after python
    :hook (python-ts-mode . python-black-on-save-mode))

#+end_src


*** astro.js

I used the [[https://medium.com/@jrmjrm/configuring-emacs-and-eglot-to-work-with-astro-language-server-9408eb709ab0][following guide]] from medium for this configuration.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

    ;; WEB MODE
    (use-package web-mode
    :straight t)

    ;; astro
    ;; ASTRO
    (define-derived-mode astro-mode web-mode "astro")
    (setq auto-mode-alist
        (append '((".*\\.astro\\'" . astro-mode))
                auto-mode-alist))
  

#+end_src

Now set the config in [[id:F9D087EE-895F-4DBC-BBCF-3056A2A5266E][eglot]].  


*** rust

Download =rust-mode=.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

    (use-package rust-mode
    :straight t
    :mode "\\.rs\\'"
    :config
    (add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-mode)))

#+end_src

Setting up =rust-mode=.

Custom function to find rust analyzer.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (defun jw/find-rust-analyzer ()
    (or (executable-find "rust-analyzer")
        (expand-file-name "~/.cargo/bin/rust-analyzer")))

#+end_src


