.emacs.d/jw-emacs-modules/jw-emacs-development.el

(electric-pair-mode t)

(add-hook 'org-mode-hook (lambda ()
         (setq-local electric-pair-inhibit-predicate
                 `(lambda (c)
                (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

(use-package evil-surround
  :straight t
  :config
  (global-evil-surround-mode 1))

(use-package command-log-mode)

(provide 'jw-emacs-development)
