Emacs.org
*** typescript

Typescript support is done through =treesit.el=, which is now native to emacs as of v29.

Therefore all of the typescript will be using the tree-sitter equivalent.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  ;; (use-package typescript-mode
  ;; :ensure t
  ;; :mode "\\.ts\\'")

#+end_src

Install =json-mode=

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  ;; (use-package json-mode
  ;; :ensure t
  ;; :mode "\\.json\\'")

#+end_src


*** apheleia.el

Make sure you have the necessary packages installed.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (use-package apheleia
    :straight t
    :config
    (setf (alist-get 'prettier-json apheleia-formatters)
        '("prettier" "--stdin-filepath" filepath))
    ;; Map json-ts-mode to the prettier-json formatter
    (setf (alist-get 'json-ts-mode apheleia-mode-alist)
        '(prettier-json))
    (add-to-list 'apheleia-mode-alist '(tsx-ts-mode . prettier))
    (add-to-list 'apheleia-mode-alist '(typescript-ts-mode . prettier))
    (add-to-list 'apheleia-mode-alist '(c++-ts-mode . clang-format))
    (add-to-list 'apheleia-mode-alist '(c-ts-mode . clang-format))
    (apheleia-global-mode +1))

#+end_src


*** eglot.el --native
:PROPERTIES:
:ID:       F9D087EE-895F-4DBC-BBCF-3056A2A5266E
:END:

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

    ;; Dynamic server program functions
    (defun jw/python-lsp-program (&optional interactive)
    "Get Python LSP program."
    (if (file-remote-p default-directory)
        '("/home/jozhw/bin/pylsp-wrapper")
        '("/opt/homebrew/Caskroom/miniconda/base/bin/pyright-langserver" "--stdio")))

        (defun jw/rust-lsp-program (&optional interactive)
        "Get Rust LSP program."
        (list (jw/find-rust-analyzer)))

        (defun jw/clangd-lsp-program (&optional interactive)
        "Get clangd LSP program."
        '("clangd"))

        (defun jw/typescript-lsp-program (&optional interactive)
        "Get TypeScript LSP program."
        '("typescript-language-server" "--stdio"))

        (defun jw/marksman-lsp-program (&optional interactive)
        "Get Marksman LSP program."
        '("marksman"))

        (defun jw/astro-lsp-program (&optional interactive)
        "Get Astro LSP program."
        '("astro-ls" "--stdio" :initializationOptions (:typescript (:tsdk "./node_modules/typescript/lib"))))


#+end_src

Add to =eglot= server list and setup hook after eglot is loaded.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

    ;; Enhanced eglot configuration
    (with-eval-after-load 'eglot
    (setq eglot-prefer-local-server t)
    ;; undo elgot modifications of completion-category-defaults
    (setq completion-category-defaults nil)
    (setq eglot-connect-timeout 120)

    ;; Use function symbols - eglot will call these functions to get the command
    (add-to-list 'eglot-server-programs
                '(python-ts-mode . jw/python-lsp-program))
    (add-to-list 'eglot-server-programs
                '(rust-mode . jw/rust-lsp-program))
    (add-to-list 'eglot-server-programs 
                '((c++-ts-mode c-ts-mode) . jw/clangd-lsp-program))
    (add-to-list 'eglot-server-programs
                '(typescript-ts-mode . jw/typescript-lsp-program))
    (add-to-list 'eglot-server-programs
                '(tsx-ts-mode . jw/typescript-lsp-program))
    (add-to-list 'eglot-server-programs 
                '(markdown-mode . jw/marksman-lsp-program))
    (add-to-list 'eglot-server-programs 
                '(astro-mode . jw/astro-lsp-program)))

#+end_src

Function to start eglot.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  ;; Function to start eglot
    (defun jw/maybe-start-eglot ()
    "Start eglot if current mode is supported and file is not remote."
    (when (and (not (file-remote-p default-directory))
                (or (derived-mode-p 'python-mode)
                    (derived-mode-p 'python-ts-mode)
                    (derived-mode-p 'rust-mode)
                    (derived-mode-p 'c-ts-mode)
                    (derived-mode-p 'c++-ts-mode)
                    (derived-mode-p 'typescript-ts-mode)
                    (derived-mode-p 'tsx-ts-mode)
                    (derived-mode-p 'markdown-mode)
                    (derived-mode-p 'astro-mode)))
        (eglot-ensure)))

  ;; Helper function to restart eglot in current buffer
  (defun jw/restart-eglot ()
    "Restart eglot in current buffer."
    (interactive)
    (when (eglot-current-server)
      (eglot-shutdown (eglot-current-server))
      (eglot-ensure)))

#+end_src

Add the hook to auto start =eglot= depending on configured language.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (add-hook 'python-ts-mode-hook #'jw/maybe-start-eglot)
  (add-hook 'rust-mode-hook #'jw/maybe-start-eglot)
  (add-hook 'c-ts-mode-hook #'jw/maybe-start-eglot)
  (add-hook 'c++-ts-mode-hook #'jw/maybe-start-eglot)
  (add-hook 'typescript-ts-mode-hook #'jw/maybe-start-eglot)
  (add-hook 'tsx-ts-mode-hook #'jw/maybe-start-eglot)
  (add-hook 'markdown-mode-hook #'jw/maybe-start-eglot)
  (add-hook 'astro-mode-hook #'jw/maybe-start-eglot)

#+end_src


*** dape.el

For debuggin,

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (use-package dape
    :straight t
    ;; :preface
    ;; By default dape shares the same keybinding prefix as `gud'
    ;; If you do not want to use any prefix, set it to nil.
    ;; (setq dape-key-prefix "\C-x\C-a")

    :hook
    ;; Save breakpoints on quit
    (kill-emacs . dape-breakpoint-save)
    ;; Load breakpoints on startup
    ;; (after-init . dape-breakpoint-load)

    :config
    ;; Turn on global bindings for setting breakpoints with mouse
    ;; (dape-breakpoint-global-mode)

    ;; Info buffers to the right
    (setq dape-buffer-window-arrangement 'right)

    ;; Info buffers like gud (gdb-mi)
    (setq dape-buffer-window-arrangement 'gud)
    (setq dape-info-hide-mode-line nil)

    ;; Pulse source line (performance hit)
    (add-hook 'dape-display-source-hook 'pulse-momentary-highlight-one-line)

    ;; Showing inlay hints
    (setq dape-inlay-hints t)

    ;; Save buffers on startup, useful for interpreted languages
    (add-hook 'dape-start-hook (lambda () (save-some-buffers t t)))

    ;; Kill compile buffer on build success
    (add-hook 'dape-compile-hook 'kill-buffer)

    ;; Projectile users
    ;; (setq dape-cwd-function 'projectile-project-root)
    )

  ;; Enable repeat mode for more ergonomic `dape' use
  (use-package repeat
    :config
    (repeat-mode))

#+end_src


*** tramp-sh.el

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  ;; for remote configs
  (with-eval-after-load 'tramp
    (require 'tramp-sh)
    (setq tramp-own-remote-path '("/bin" "/usr/bin" "/usr/local/bin"))
    (add-to-list 'tramp-remote-path 'tramp-own-remote-path))

#+end_src


*** The =jw-emacs-langs.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (provide 'jw-emacs-langs)

#+end_src

* The custom libraries of my Emacs configuration (=jw-lisp/=)
** The =jw-copy.el= library

*** jw-dired-get-file-path

Copy file path.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-lisp/jw-copy.el" :mkdirp yes
  (defun jw-dired-get-file-path ()
    "Get the full path of the file at point in Dired mode and display it in the minibuffer."
    (interactive)
    (let ((file (dired-get-file-for-visit)))
      (message file)
      (kill-new file)))

  (define-key dired-mode-map (kbd "C-c p") 'jw-dired-get-file-path)

#+end_src

*** jw-copy-file

Copy a file.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-lisp/jw-copy.el" :mkdirp yes

  (defun jw-copy-file (source-file destination-file)
    "Copy a file from SOURCE-FILE to DESTINATION-FILE."
    (interactive "FSource file: \nFDestination file: ")
    (if (file-exists-p source-file)
        (let ((dest-dir (file-name-directory destination-file)))
          (if (file-exists-p dest-dir)
              (if (not (file-exists-p destination-file))
                  (progn
                    (copy-file source-file destination-file)
                    (message "File copied successfully."))
                (message "Destination file already exists. Choose another destination."))
            (message "Destination directory does not exist.")))
      (message "Source file does not exist.")))

#+end_src

*** The =jw-copy.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-lisp/jw-copy.el" :mkdirp yes

  (provide 'jw-copy)

#+end_src

